export const siteHistory = {
    "historyList": [
        {
            "date": "2023-02-04",
            "content": "ポケモンと道具の画像表示を追加、公開構築設定画面の改修"
        },
        {
            "date": "2023-01-27",
            "content": "LINEログインに対応、HP偶数警告の非表示に対応、一部スマホ用レイアウトの調整、テラスタイプの表示を画像に変更"
        },
        {
            "date": "2023-01-20",
            "content": "新規ポケモン追加画面の微改修"
        },
        {
            "date": "2023-01-16",
            "content": "道具の詳細表示に対応"
        },
        {
            "date": "2023-01-07",
            "content": "SVの新ポケモンや技、テラスタイプに対応"
        },
        {
            "date": "2022-10-03",
            "content": "一部ポケモンで覚える技のみの表示に対応"
        },
        {
            "date": "2022-09-27",
            "content": "UIや動作を改善、HP偶数警告を追加"
        },
        {
            "date": "2022-09-20",
            "content": "ニックネーム機能を追加、公開シェア機能を追加"
        },
        {
            "date": "2022-09-17",
            "content": "育成済みポケモン一覧機能、S調整機能、複数構築機能を追加、一部マスターデータの修正"
        },
        {
            "date": "2022-08-25",
            "content": "サービス開始"
        }
    ]
}