import {PokemonNature} from "../type/type";

export function getNatureList(): [PokemonNature, string, string][] {
    return (
        [
            ["さみしがり", "攻撃", "防御"],
            ["いじっぱり", "攻撃", "特攻"],
            ["やんちゃ", "攻撃", "特防"],
            ["ゆうかん", "攻撃", "素早さ"],
            ["ずぶとい", "防御", "攻撃"],
            ["わんぱく", "防御", "特攻"],
            ["のうてんき", "防御", "特防"],
            ["のんき", "防御", "素早さ"],
            ["ひかえめ", "特攻", "攻撃"],
            ["おっとり", "特攻", "防御"],
            ["うっかりや", "特攻", "特防"],
            ["れいせい", "特攻", "素早さ"],
            ["おだやか", "特防", "攻撃"],
            ["おとなしい", "特防", "防御"],
            ["しんちょう", "特防", "特攻"],
            ["なまいき", "特防", "素早さ"],
            ["おくびょう", "素早さ", "攻撃"],
            ["せっかち", "素早さ", "防御"],
            ["ようき", "素早さ", "特攻"],
            ["むじゃき", "素早さ", "特防"],
            ["てれや", "なし", "なし"],
            ["がんばりや", "なし", "なし"],
            ["すなお", "なし", "なし"],
            ["きまぐれ", "なし", "なし"],
            ["まじめ", "なし", "なし"]
        ]
    )
}