import {PokemonNature, PokemonValue} from "../type/type";

export function getNatureList(): [PokemonNature, string, string, PokemonValue][] {
        return (
            [
                    ["さみしがり", "攻撃", "防御", {h: 1, a: 1.1, b: 0.9, c: 1, d: 1, s: 1}],
                    ["いじっぱり", "攻撃", "特攻", {h: 1, a: 1.1, b: 1, c: 0.9, d: 1, s: 1}],
                    ["やんちゃ", "攻撃", "特防", {h: 1, a: 1.1, b: 1, c: 1, d: 0.9, s: 1}],
                    ["ゆうかん", "攻撃", "素早さ", {h: 1, a: 1.1, b: 1, c: 1, d: 1, s: 0.9}],
                    ["ずぶとい", "防御", "攻撃", {h: 1, a: 0.9, b: 1.1, c: 1, d: 1, s: 1}],
                    ["わんぱく", "防御", "特攻", {h: 1, a: 1, b: 1.1, c: 0.9, d: 1, s: 1}],
                    ["のうてんき", "防御", "特防", {h: 1, a: 1, b: 1.1, c: 1, d: 0.9, s: 1}],
                    ["のんき", "防御", "素早さ", {h: 1, a: 1, b: 1.1, c: 1, d: 1, s: 0.9}],
                    ["ひかえめ", "特攻", "攻撃", {h: 1, a: 0.9, b: 1, c: 1.1, d: 1, s: 1}],
                    ["おっとり", "特攻", "防御", {h: 1, a: 1, b: 0.9, c: 1.1, d: 1, s: 1}],
                    ["うっかりや", "特攻", "特防", {h: 1, a: 1, b: 1, c: 1.1, d: 0.9, s: 1}],
                    ["れいせい", "特攻", "素早さ", {h: 1, a: 1, b: 1, c: 1.1, d: 1, s: 0.9}],
                    ["おだやか", "特防", "攻撃", {h: 1, a: 0.9, b: 1, c: 1, d: 1.1, s: 1}],
                    ["おとなしい", "特防", "防御", {h: 1, a: 1, b: 0.9, c: 1, d: 1.1, s: 1}],
                    ["しんちょう", "特防", "特攻", {h: 1, a: 1, b: 1, c: 0.9, d: 1.1, s: 1}],
                    ["なまいき", "特防", "素早さ", {h: 1, a: 1, b: 1, c: 1, d: 1.1, s: 0.9}],
                    ["おくびょう", "素早さ", "攻撃", {h: 1, a: 0.9, b: 1, c: 1, d: 1, s: 1.1}],
                    ["せっかち", "素早さ", "防御", {h: 1, a: 1, b: 0.9, c: 1, d: 1, s: 1.1}],
                    ["ようき", "素早さ", "特攻", {h: 1, a: 1, b: 1, c: 0.9, d: 1, s: 1.1}],
                    ["むじゃき", "素早さ", "特防", {h: 1, a: 1, b: 1, c: 1, d: 0.9, s: 1.1}],
                    ["てれや", "なし", "なし", {h: 1, a: 1, b: 1, c: 1, d: 1, s: 1}],
                    ["がんばりや", "なし", "なし", {h: 1, a: 1, b: 1, c: 1, d: 1, s: 1}],
                    ["すなお", "なし", "なし", {h: 1, a: 1, b: 1, c: 1, d: 1, s: 1}],
                    ["きまぐれ", "なし", "なし", {h: 1, a: 1, b: 1, c: 1, d: 1, s: 1}],
                    ["まじめ", "なし", "なし", {h: 1, a: 1, b: 1, c: 1, d: 1, s: 1}]
            ]
    )
}